backend/tests/stress/reports/20260528-164735/login_throughput.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/bahtiyarelik/Developer/diploma/backend/tests/stress/scenarios/login_throughput.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 1m0s max duration (incl. graceful stop):
              * login_burst: 30.00 iterations/s for 30s (maxVUs: 30-80, gracefulStop: 30s)


running (0m01.0s), 02/30 VUs, 28 complete and 0 interrupted iterations
login_burst   [   3% ] 02/30 VUs  01.0s/30s  30.00 iters/s

running (0m02.0s), 02/30 VUs, 58 complete and 0 interrupted iterations
login_burst   [   7% ] 02/30 VUs  02.0s/30s  30.00 iters/s

running (0m03.0s), 02/30 VUs, 88 complete and 0 interrupted iterations
login_burst   [  10% ] 02/30 VUs  03.0s/30s  30.00 iters/s

running (0m04.0s), 02/30 VUs, 118 complete and 0 interrupted iterations
login_burst   [  13% ] 02/30 VUs  04.0s/30s  30.00 iters/s

running (0m05.0s), 02/30 VUs, 148 complete and 0 interrupted iterations
login_burst   [  17% ] 02/30 VUs  05.0s/30s  30.00 iters/s

running (0m06.0s), 02/30 VUs, 178 complete and 0 interrupted iterations
login_burst   [  20% ] 02/30 VUs  06.0s/30s  30.00 iters/s

running (0m07.0s), 02/30 VUs, 208 complete and 0 interrupted iterations
login_burst   [  23% ] 02/30 VUs  07.0s/30s  30.00 iters/s

running (0m08.0s), 02/30 VUs, 238 complete and 0 interrupted iterations
login_burst   [  27% ] 02/30 VUs  08.0s/30s  30.00 iters/s

running (0m09.0s), 02/30 VUs, 268 complete and 0 interrupted iterations
login_burst   [  30% ] 02/30 VUs  09.0s/30s  30.00 iters/s

running (0m10.0s), 02/30 VUs, 298 complete and 0 interrupted iterations
login_burst   [  33% ] 02/30 VUs  10.0s/30s  30.00 iters/s

running (0m11.0s), 02/30 VUs, 328 complete and 0 interrupted iterations
login_burst   [  37% ] 02/30 VUs  11.0s/30s  30.00 iters/s

running (0m12.0s), 02/30 VUs, 358 complete and 0 interrupted iterations
login_burst   [  40% ] 02/30 VUs  12.0s/30s  30.00 iters/s

running (0m13.0s), 02/30 VUs, 388 complete and 0 interrupted iterations
login_burst   [  43% ] 02/30 VUs  13.0s/30s  30.00 iters/s

running (0m14.0s), 02/30 VUs, 418 complete and 0 interrupted iterations
login_burst   [  47% ] 02/30 VUs  14.0s/30s  30.00 iters/s

running (0m15.0s), 02/30 VUs, 448 complete and 0 interrupted iterations
login_burst   [  50% ] 02/30 VUs  15.0s/30s  30.00 iters/s

running (0m16.0s), 02/30 VUs, 478 complete and 0 interrupted iterations
login_burst   [  53% ] 02/30 VUs  16.0s/30s  30.00 iters/s

running (0m17.0s), 02/30 VUs, 508 complete and 0 interrupted iterations
login_burst   [  57% ] 02/30 VUs  17.0s/30s  30.00 iters/s

running (0m18.0s), 02/30 VUs, 538 complete and 0 interrupted iterations
login_burst   [  60% ] 02/30 VUs  18.0s/30s  30.00 iters/s

running (0m19.0s), 02/30 VUs, 568 complete and 0 interrupted iterations
login_burst   [  63% ] 02/30 VUs  19.0s/30s  30.00 iters/s

running (0m20.0s), 02/30 VUs, 598 complete and 0 interrupted iterations
login_burst   [  67% ] 02/30 VUs  20.0s/30s  30.00 iters/s

running (0m21.0s), 02/30 VUs, 628 complete and 0 interrupted iterations
login_burst   [  70% ] 02/30 VUs  21.0s/30s  30.00 iters/s

running (0m22.0s), 02/30 VUs, 658 complete and 0 interrupted iterations
login_burst   [  73% ] 02/30 VUs  22.0s/30s  30.00 iters/s

running (0m23.0s), 02/30 VUs, 688 complete and 0 interrupted iterations
login_burst   [  77% ] 02/30 VUs  23.0s/30s  30.00 iters/s

running (0m24.0s), 02/30 VUs, 718 complete and 0 interrupted iterations
login_burst   [  80% ] 02/30 VUs  24.0s/30s  30.00 iters/s

running (0m25.0s), 02/30 VUs, 748 complete and 0 interrupted iterations
login_burst   [  83% ] 02/30 VUs  25.0s/30s  30.00 iters/s

running (0m26.0s), 02/30 VUs, 778 complete and 0 interrupted iterations
login_burst   [  87% ] 02/30 VUs  26.0s/30s  30.00 iters/s

running (0m27.0s), 02/30 VUs, 808 complete and 0 interrupted iterations
login_burst   [  90% ] 02/30 VUs  27.0s/30s  30.00 iters/s

running (0m28.0s), 02/30 VUs, 838 complete and 0 interrupted iterations
login_burst   [  93% ] 02/30 VUs  28.0s/30s  30.00 iters/s

running (0m29.0s), 02/30 VUs, 868 complete and 0 interrupted iterations
login_burst   [  97% ] 02/30 VUs  29.0s/30s  30.00 iters/s

running (0m30.0s), 02/30 VUs, 898 complete and 0 interrupted iterations
login_burst   [ 100% ] 02/30 VUs  30.0s/30s  30.00 iters/s


  █ THRESHOLDS 

    http_req_duration{name:/api/login}
    ✓ 'p(95)<700' p(95)=81.56ms
    ✓ 'p(99)<1200' p(99)=90.64ms

    http_req_failed
    ✗ 'rate<0.02' rate=28.99%


  █ TOTAL RESULTS 

    checks_total.......: 900    29.953197/s
    checks_succeeded...: 71.00% 639 out of 900
    checks_failed......: 28.99% 261 out of 900

    ✗ login 2xx
      ↳  71% — ✓ 639 / ✗ 261

    HTTP
    http_req_duration..............: avg=56.97ms min=307µs   med=79ms    max=134.96ms p(90)=80.7ms  p(95)=81.56ms
      { expected_response:true }...: avg=80ms    min=78.14ms med=79.36ms max=134.96ms p(90)=81.09ms p(95)=82.14ms
      { name:/api/login }..........: avg=56.97ms min=307µs   med=79ms    max=134.96ms p(90)=80.7ms  p(95)=81.56ms
    http_req_failed................: 28.99% 261 out of 900
    http_reqs......................: 900    29.953197/s

    EXECUTION
    iteration_duration.............: avg=57.13ms min=379.7µs med=79.13ms max=135.13ms p(90)=80.92ms p(95)=81.78ms
    iterations.....................: 900    29.953197/s
    vus............................: 2      min=2          max=2 
    vus_max........................: 30     min=30         max=30

    NETWORK
    data_received..................: 840 kB 28 kB/s
    data_sent......................: 165 kB 5.5 kB/s



running (0m30.0s), 00/30 VUs, 900 complete and 0 interrupted iterations
login_burst ✓ [ 100% ] 00/30 VUs  30s  30.00 iters/s